rocksdb/experiments/M2/results/20260429-020219/budget_off/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 02:11:17 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777428677781430 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       6.575 micros/op 152088 ops/sec 32.876 seconds 5000000 operations;  150.8 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      11.991 micros/op 83394 ops/sec 59.956 seconds 5000000 operations;   82.7 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      14.991 micros/op 66705 ops/sec 74.956 seconds 5000000 operations;   66.2 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      5/0   311.41 MB   1.2      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    431.7     34.63             24.53       240    0.144       0      0       0.0       0.0
  L1     31/1    1.87 GB   7.3     27.2    14.3     12.9      23.6     10.7       0.0   1.7    276.7    240.6    100.63             82.57        18    5.591     27M  3612K       0.0       0.0
  L2     99/1    4.46 GB   1.8     17.8     8.3      9.5      13.4      3.9       0.6   1.6    287.2    216.0     63.38             50.79       122    0.520     18M  4486K       0.0       0.0
 Sum    135/2    6.64 GB   0.0     45.0    22.6     22.4      51.6     29.2       0.6   3.5    231.8    266.0    198.64            157.90       380    0.523     45M  8098K       0.0       0.0
 Int      0/0    0.00 KB   0.0     44.7    22.4     22.4      50.9     28.6       0.6   3.6    232.2    264.5    197.24            156.81       372    0.530     45M  8094K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     45.0    22.6     22.4      37.0     14.6       0.0   0.0    280.8    231.1    164.01            133.36       140    1.172     45M  8098K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    431.7     34.63             24.53       240    0.144       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 167.8 total, 164.8 interval
Flush(GB): cumulative 14.598, interval 14.172
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 51.61 GB write, 314.94 MB/s write, 44.97 GB read, 274.43 MB/s read, 198.6 seconds
Interval compaction: 50.94 GB write, 316.56 MB/s write, 44.73 GB read, 277.93 MB/s read, 197.2 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 25, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 32, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 32, total-stops: 0
interval: 32 total count
Block cache LRUCache@0x560c2c728df0#75619 capacity: 32.00 MB seed: 1559488438 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.00019 secs_since: 167
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 167.8 total, 164.8 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 90.03 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 90.03 MB/s
Cumulative stall: 00:01:10.031 H:M:S, 41.7 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14651.62 MB, 88.91 MB/s
Interval WAL: 14M writes, 0 syncs, 14548619.00 writes per sync, written: 14.31 GB, 88.91 MB/s
Interval stall: 00:01:10.031 H:M:S, 42.5 percent
Write Stall (count): write-buffer-manager-limit-stops: 0